<?
require_once __DIR__ . '/class.birthday.php';

class BirthdayYi extends Birthday {
    protected $lang_id = 2;
    protected $description = 'יום הולדת';
    protected $category = 'יום הולדת';
    protected $mandTasks = array(
        "אמרתי את פרק התהילים החדש שלי.",
        "עשיתי התוועדות כדי להודות לקב\"ה שהגעתי ליום המיוחד הזה.",
        "קיבלתי החלטה חדשה. מה ההחלטה שלך?________________________"
    );
    protected $optTasks = array(
        "התפללתי בתוספת כוונה.",
        "הוספתי בצדקה לפני תפילת שחרית (ומנחה. אם יום ההולדת שלי היה בשבת, הוספתי לפני ואחרי השבת).",
        "למדתי את הפרק החדש שלי.",
        "עשיתי חשבון נפש כדי לדעת באיזה תחומים אני מצליח ובאיזה תחומים אני צריך להשתפר.",
        "ברכתי שהחיינו על פרי חדש.",
        "הוספתי בתורה. מה למדת? ________________________",
        "הוספתי באהבת ישראל. איך הוספת באהבת ישראל? ___________"
    );
    protected $qtyTasks = array(
        '1-150' => "אמרתי עוד תהילים. כמה פרקים אמרת? _____"
    );
    protected $boysAgeTasks = array(
        '10' => "למדתי חלק ממאמר בעל פה וחזרתי עליו (ביום ההולדת שלי או בשבת שאחרי). איזה מאמר למדת? __________________",
        '13' => "בשבת לפני יום ההולדת שלי (אם יום ההולדת שלי חל ביום הקריאה) עליתי לתורה."
    );

    protected function missionName($yomHoledes, $yearsOld) {
        return "מזל טוב לרגל היום ההולדת ה - " . $yomHoledes;
    }
}
