<?
require_once __DIR__ . '/class.birthday.php';

class BirthdayYi extends Birthday {
	protected $lang_id = 2;
	protected $description = 'יום הולדת';
	protected $category = 'יום הולדת';
	protected $mandTasks = array(
		"איך האב געזאגט מיין נייער קאפיטל", 
		"איך האב געמאכט א פארבריינגען צו דאנקעןדעםאויבערשטן פאר מירצובריינגען צו דערספעציעלערטאג", 
		"איך האב געמאכט א נייער החלטה. וואס איז דיין החלטה:_________________"
	);
	protected $optTasks = array(
		"איך האב געדאווענט מיט מער כוונה", 
		"איך האב געגעבן צדקה פאר שחרית און פאר מנחה (אויב מיין יום הולדת פאלטאויסאויף שבת, האב איך געגעבן צדקה פאר און נאך שבת)",
		"איך האב געלערנט מיין נייער קאפיטל",
		"איך האב געמאכט א חשבון הנפש, זאכן וואס איך האב געטאן גוט, און זאכן וואס איך דארף פארבעסערן",
		"איך האב געמאכט א ברכה שהחיינו אויף א נייע פרוכט",
		"איך האב צוגעגבן אין לערנען תורה. וואס האסטוגעלערנט?_________________",
		"איך האב צוגעגעבן אין אהבת ישראל. וואס האסטוגעטאן?_________________"
	);
	protected $qtyTasks = array(
		'1-150' => "איך האב צוגעגעבן אין זאגן תהילים. וויפל קאפיטלעך האסטו געזאגט?___________________"
	);
	protected $boysAgeTasks = array(
		'10' => "איך האב געלערנט א טייל פון א מאמר אויף אויסווייניק, און עסגע'חזר'ט (אויפןטאג פון מיין יום הולדת, אדערדער שבת נאךדעם). וועלכער מאמר האסטו גע'חזר'ט? _____________________",
		'13' => "שבת פאר מיין יום הולדת (אויב מיין יום הולדת איז שבת, איז אויף שבת) האב איך געהאט אן עלי' לתורה"
	);

	protected function missionName($yomHoledes, $yearsOld) {
		return "מזל טוב פאר דיין יום הולדת - " . $yomHoledes;
	}
}
