<?
require_once __DIR__ . '/class.birthday.php';

class BirthdayYi extends Birthday {
	protected $lang_id = 2;
	protected $description = 'יום הולדת';
	protected $category = 'יום הולדת';
	protected $mandTasks = array(
		"איך האב געזאגט מיין נייער קאפיטל", 
		"איך האב געמאכט א פארבריינגען צו דאנקעןדעםאויבערשטן פאר מירצובריינגען צו דערספעציעלערטאג", 
		"איך האב געמאכט א נייער החלטה. וואסאיז דיין החלטה:_________________"
	);
	protected $optTasks = array(
		"איך האב געדאווענט מיט מער כוונה", 
		"איך האב געגעבן צדקה פאר שחרית און פאר מנחה (אויב מיין יום הולדת פאלטאויסאויף שבת, האב איך געגעבן צדקה פאר און נאךשבת)", 
		"איך האב געלערנט מיין נייער קאפיטל",
		"איך האב געמאכט א חשבון הנפש, זאכן וואסאיך האב געטאןגוט, און זאכן וואס איך דארףפארבעסערן", 
		"איך האב געמאכט א ברכה שהחיינו אויף א נייעפרוכט", 
		"איך האב צוגעגבן אין לערנען תורה. וואסהאסטוגעלערנט?_________________", 
		"איך האב צוגעגעבן אין אהבת ישראל. וואסהאסטוגעטאן?_________________" 
	);
	protected $qtyTasks = array(
		'1-150' => "איך האב צוגעגעבן אין זאגן תהילים. וויפלקאפיטלעךהאסטוגעזאגט?___________________"
	);
	protected $ageTasks = array(
		'10' => "איך האב געלערנט א טייל פון א מאמר אויףאויסווייניק, און עסגע'חזר'ט (אויפןטאג פון מיין יום הולדת, אדערדער שבת נאךדעם). וועלכער מאמר האסטוגע'חזר'ט? _____________________",
		'13' => "שבת פאר מיין יום הולדת (אויב מיין יום הולדת איז שבת, איזאויף שבת) האב איך געהאט אן עלי' לתורה"
	);

	protected function missionName($yomHoledes, $yearsOld) {
		return "מזל טוב פאר דיין יום הולדת - " . $yomHoledes;
	}
}
